# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [7]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (1.3.16)
Note: you may need to restart the kernel to use updated packages.

In [8]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (0.4.0)
Requirement already satisfied: ipython>=1.0 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (7.14.0)
Requirement already satisfied: six in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (1.14.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlparse in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython-sql) (1.3.16)
Requirement already satisfied: decorator in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: backcall in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (3.0.5)
Requirement already satisfied: setuptools>=18.5 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (46.1.3.post20200330)
Requirement already satisfied: traitlets>=4.2 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: pexpect; sys_platform != "win32" in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pickleshare in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.10 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.17.0)
Requirement already satisfied: wcwidth in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.9)
Requirement already satisfied: ptyprocess>=0.5 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)
Requirement already satisfied: parso>=0.7.0 in /home/carmencuadrado/miniconda3/envs/Ironhack/lib/python3.7/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
%load_ext sql
%config SqlMagic.autocommit = False

In [2]:
%sql sqlite:////home/carmencuadrado/Ironhack/dataptmad0420/module-1/importing-exporting-data/your-code/juliarochflores.db

In [3]:
%%sql tables <<

SELECT 
    name
FROM 
    sqlite_master
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';

 * sqlite:////home/carmencuadrado/Ironhack/dataptmad0420/module-1/importing-exporting-data/your-code/juliarochflores.db
Done.
Returning data to local variable tables

In [4]:
tables.DataFrame()

            name
0      rank_info
1  personal_info
2  business_info

In [5]:
%%sql left <<


SELECT 
name,
position,
gender,
country
FROM rank_info
JOIN personal_info
ON rank_info.id = personal_info.id;

 * sqlite:////home/carmencuadrado/Ironhack/dataptmad0420/module-1/importing-exporting-data/your-code/juliarochflores.db
Done.
Returning data to local variable left

In [6]:
left.DataFrame()

                 name  position  gender                     country
0          jefF BEZOs       1.0    None               United States
1          bILL GATES       2.0    Male                        None
2      WARREN BUFFEtt       3.0       M                        None
3     bernARD ARNAULT       4.0    None                      France
4     maRK ZUCKERBERG       5.0    None               United States
...               ...       ...     ...                         ...
2203   zhao XIAOQiang    2204.0       M                       China
2204  zHOU LIANgzhang    2205.0    None                        None
2205     zhu XINGMIng    2206.0       M  People's Republic of China
2206         ZHUO JUN    2207.0  Female                        None
2207      olguN ZOrlu    2208.0       M                      Turkey

[2208 rows x 4 columns]

# Challenge 2 - Working with JSON files

Import the pandas library.

In [7]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [8]:
# your code here
nasa=pd.read_json("../data/nasa.json")

Now that we have loaded the data, let's examine it using the `head()` function.

In [9]:
# your code here
nasa.head()

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [10]:
# your code here
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [11]:
# your code here
nasa.to_json(r'../data/nasa-output.json',orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [12]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [13]:
# your code here
shuttle=pd.read_csv(tst_url,names=cols,sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [14]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [15]:
# your code here
shuttle.to_csv(r'../data/shuttle.csv', index=False, sep=',')

In [16]:
pd.read_csv(r'../data/shuttle.csv')

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
0,0,81,0,-6,11,25,88,64,4
1,0,96,0,52,-4,40,44,4,4
2,-1,89,-7,50,0,39,40,2,1
3,9,79,0,42,-2,25,37,12,4
4,2,82,0,54,-6,26,28,2,1
...,...,...,...,...,...,...,...,...,...
14495,0,84,0,-36,-29,4,120,116,5
14496,0,81,0,-20,25,26,102,76,4
14497,0,77,0,12,-22,22,65,42,4
14498,0,103,0,18,-16,66,85,20,1
14499,2,98,0,52,1,42,46,4,4

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [17]:
!conda install -y xlrd

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

In [18]:
# your code here
astronaut=pd.read_excel(r'../data/astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [19]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [20]:
# your code here
astronaut['Undergraduate Major'].value_counts()

Physics                                    35
Aerospace Engineering                      33
Mechanical Engineering                     30
Aeronautical Engineering                   28
Electrical Engineering                     23
                                           ..
Military Science                            1
Astronautics                                1
Applied Biology; Mechanical Engineering     1
Bioscience                                  1
Biochemistry                                1
Name: Undergraduate Major, Length: 83, dtype: int64

In [21]:
#The most direct way of fiding out the most popular undergraduate major among all astronauts is to ask for the mode
astronaut['Undergraduate Major'].mode()

0    Physics
dtype: object

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [22]:
# your code here
astronaut.to_csv(r'../data/astronaut.csv',index=False, sep=' ')

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [23]:
# your code here
cols_1=['season','age','childish','accident','surgical intervention','high fevers','Frecuency of alcohol consumption','smoking habit','Number of hours spent sitting per day','output']
fertility=pd.read_csv(r'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt', names=cols_1, sep=',')

In [24]:
fertility.head()

,season,age,childish,accident,surgical intervention,high fevers,Frecuency of alcohol consumption,smoking habit,Number of hours spent sitting per day,output
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O

In [81]:
#Octavio Bonus
import zipfile
x= zipfile.ZipFile(r'../data/challenge3.zip')

In [82]:
cols_2=pd.read_csv(x.open(r'Supply_Food_Data_Descriptions.csv'))

In [83]:
cols_2.head()

                 Categories                                              Items
0       Alcoholic Beverages  Alcohol, Non-Food; Beer; Beverages, Alcoholic;...
1               Animal fats  Butter, Ghee; Cream; Fats, Animals, Raw; Fish,...
2           Animal Products  Aquatic Animals, Others; Aquatic Plants; Bovin...
3   Aquatic Products, Other  Aquatic Animals, Others; Aquatic Plants; Meat,...
4  Cereals - Excluding Beer  Barley and products; Cereals, Other; Maize and...

In [94]:
Octavio_bonus = pd.read_csv(x.open('Food_Supply_Quantity_kg_Data_No_Header.txt'), names=cols_2, sep='\t')

In [93]:
Octavio_bonus.head()

,0,Afghanistan,0.0014,0.1973,9.4341,0.0,24.8097,0.2099,0.035,5.3495,...,0.2953,0.0574,0.8802,0.3078,1.3489,0.0.1,0.077,0.5345,6.7642,40.5645
0,1,Albania,1.6719,0.1357,18.7684,0.0,5.7817,0.5815,0.2126,6.7861,...,0.2380,0.0008,1.8096,0.1055,1.5367,0.0,0.1515,0.3261,11.7753,31.2304
1,2,Algeria,0.2711,0.0282,9.6334,0.0,13.6816,0.5277,0.2416,6.3801,...,0.4783,0.0557,4.1340,0.2216,1.8342,0.0,0.1152,1.0310,11.6484,40.3651
2,3,Angola,5.8087,0.0560,4.9278,0.0,9.1085,0.0587,1.7707,6.0005,...,0.6507,0.0009,18.1102,0.0508,1.8495,0.0,0.0061,0.6463,2.3041,45.0722
3,4,Antigua and Barbuda,3.5764,0.0087,16.6613,0.0,5.9960,0.2274,4.1489,10.7451,...,0.1840,0.1524,1.4522,0.1564,3.8749,0.0,0.0253,0.8102,5.4495,33.3233
4,5,Argentina,4.2672,0.2234,19.3454,0.0,8.4102,0.9979,0.4693,6.0435,...,0.0528,0.0122,3.0420,0.4378,3.0536,0.0,0.0200,0.9541,4.3503,30.6559